Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/RecordSetModule.bsl
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, Замещение)
	// проверка
	ТолькоОР = Новый Массив();
	Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
		Если ТолькоОР.Найти(СтрокаНабораЗаписей.ОбъектИерархии) = Неопределено Тогда 
			ТолькоОР.Добавить(СтрокаНабораЗаписей.ОбъектИерархии);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ОбъектРемонтаИзМассива Из ТолькоОР Цикл
		НаборЗаписейРегистраСведений = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
		НаборЗаписейРегистраСведений.Отбор.Объект.Установить(ОбъектРемонтаИзМассива);
		НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраСведений.Добавить();
		НоваяСтрокаНабораЗаписей.Объект = ОбъектРемонтаИзМассива;
		НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
		НаборЗаписейРегистраСведений.Записать();
	КонецЦикла;
	// История
	Если Не Отказ И Константы.торо_ДатаНачалаФиксацииПеремещенийМеждуФМ.Получить() <= ТекущаяДата() Тогда 
		ВременнаяТаблицаЗначений = Новый ТаблицаЗначений();
		ВременнаяТаблицаЗначений.Колонки.Добавить("ОбъектИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ВременнаяТаблицаЗначений.Колонки.Добавить("РодительИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ВременнаяТаблицаЗначений.Колонки.Добавить("СтруктураИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"));
		ВременнаяТаблицаЗначений.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
			НоваяСтрокаНабораЗАписей = ВременнаяТаблицаЗначений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНабораЗАписей,СтрокаНабораЗаписей);
			Если ЗначениеЗаполнено(СтрокаНабораЗаписей.Период) = Ложь Тогда 
				НоваяСтрокаНабораЗАписей.Период = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЦикла;

		Запрос = Новый запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЧ.ОбъектИерархии КАК ОбъектИерархии,
		               |	ВЫРАЗИТЬ(ТЧ.РодительИерархии КАК Справочник.торо_ОбъектыРемонта) КАК РодительИерархии,
		               |	ТЧ.СтруктураИерархии КАК СтруктураИерархии,
		               |	ТЧ.Период КАК Период
		               |ПОМЕСТИТЬ Исходная
		               |ИЗ
		               |	&ТЧ КАК ТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		               |	Исходная.СтруктураИерархии КАК СтруктураИерархии
		               |ПОМЕСТИТЬ РодителиОР1
		               |ИЗ
		               |	Исходная КАК Исходная
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		               |		ПО Исходная.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		               |			И (торо_ИерархическиеСтруктурыОР.СтруктураИерархии = Исходная.СтруктураИерархии)
		               |			И (НЕ Исходная.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
		               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
		               |ПОМЕСТИТЬ РодителиОР2
		               |ИЗ
		               |	РодителиОР1 КАК РодителиОР1
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		               |		ПО РодителиОР1.СтруктураИерархии = торо_ИерархическиеСтруктурыОР.СтруктураИерархии
		               |			И РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		               |			И (НЕ РодителиОР1.ЭтоФМ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		               |	Исходная.СтруктураИерархии КАК СтруктураИерархии
		               |ПОМЕСТИТЬ ПредРодителиОР1
		               |ИЗ
		               |	Исходная КАК Исходная
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		               |		ПО Исходная.ОбъектИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		               |			И (торо_ИерархическиеСтруктурыОР.СтруктураИерархии = Исходная.СтруктураИерархии)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
		               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
		               |ПОМЕСТИТЬ ПредРодителиОР2
		               |ИЗ
		               |	ПредРодителиОР1 КАК РодителиОР1
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		               |		ПО РодителиОР1.СтруктураИерархии = торо_ИерархическиеСтруктурыОР.СтруктураИерархии
		               |			И РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		               |			И (НЕ РодителиОР1.ЭтоФМ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
		               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
		               |ПОМЕСТИТЬ ПредРодителиОР3
		               |ИЗ
		               |	ПредРодителиОР2 КАК РодителиОР1
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		               |		ПО РодителиОР1.СтруктураИерархии = торо_ИерархическиеСтруктурыОР.СтруктураИерархии
		               |			И РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		               |			И (НЕ РодителиОР1.ЭтоФМ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПредРодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
		               |	ПредРодителиОР1.РодительИерархии КАК РодительИерархии,
		               |	ПредРодителиОР1.СтруктураИерархии КАК СтруктураИерархии
		               |ПОМЕСТИТЬ ВсеПрошлые
		               |ИЗ
		               |	ПредРодителиОР1 КАК ПредРодителиОР1
		               |ГДЕ
		               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПредРодителиОР1.ОбъектИерархии,
		               |	ПредРодителиОР1.РодительИерархии,
		               |	ПредРодителиОР1.СтруктураИерархии
		               |ИЗ
		               |	ПредРодителиОР2 КАК ПредРодителиОР1
		               |ГДЕ
		               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПредРодителиОР1.ОбъектИерархии,
		               |	ПредРодителиОР1.РодительИерархии,
		               |	ПредРодителиОР1.СтруктураИерархии
		               |ИЗ
		               |	ПредРодителиОР3 КАК ПредРодителиОР1
		               |ГДЕ
		               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
		               |	Исходная.РодительИерархии КАК РодительИерархии,
		               |	Исходная.СтруктураИерархии КАК СтруктураИерархии,
		               |	Исходная.Период КАК Период,
		               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии) КАК ПредыдущийРодитель,
		               |	ВЫБОР
		               |		КОГДА Исходная.РодительИерархии.ТипОбъекта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ Исходная.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		               |	КОНЕЦ КАК ЭтоМонтаж,
		               |	ВЫБОР
		               |		КОГДА Предыдущий.РодительИерархии.ТипОбъекта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ Предыдущий.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		               |	КОНЕЦ КАК ЭтоДемонтаж
		               |ПОМЕСТИТЬ БезПодчиненных
		               |ИЗ
		               |	Исходная КАК Исходная
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Предыдущий
		               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = Предыдущий.СтруктураИерархии
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
		               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
		               |ГДЕ
		               |	(НЕ ВсеПрошлые.РодительИерархии ЕСТЬ NULL
		               |			ИЛИ Исходная.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		               |			ИЛИ НЕ Предыдущий.РодительИерархии ЕСТЬ NULL
		               |				И Предыдущий.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Исходная.ОбъектИерархии,
		               |	РодителиОР1.РодительИерархии,
		               |	Исходная.СтруктураИерархии,
		               |	Исходная.Период,
		               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии),
		               |	ИСТИНА,
		               |	ВЫБОР
		               |		КОГДА Предыдущий.РодительИерархии.ТипОбъекта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ Предыдущий.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		               |	КОНЕЦ
		               |ИЗ
		               |	Исходная КАК Исходная
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Предыдущий
		               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = Предыдущий.СтруктураИерархии
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РодителиОР1 КАК РодителиОР1
		               |		ПО Исходная.ОбъектИерархии = РодителиОР1.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = РодителиОР1.СтруктураИерархии
		               |			И (РодителиОР1.ЭтоФМ)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
		               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Исходная.ОбъектИерархии,
		               |	РодителиОР2.РодительИерархии,
		               |	Исходная.СтруктураИерархии,
		               |	Исходная.Период,
		               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии),
		               |	ИСТИНА,
		               |	ВЫБОР
		               |		КОГДА Предыдущий.РодительИерархии.ТипОбъекта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ Предыдущий.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		               |	КОНЕЦ
		               |ИЗ
		               |	Исходная КАК Исходная
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Предыдущий
		               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = Предыдущий.СтруктураИерархии
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РодителиОР2 КАК РодителиОР2
		               |		ПО Исходная.ОбъектИерархии = РодителиОР2.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = РодителиОР2.СтруктураИерархии
		               |			И (РодителиОР2.ЭтоФМ)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
		               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
		               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
		               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
		               |	БезПодчиненных.Период КАК Период,
		               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
		               |	БезПодчиненных.ЭтоМонтаж КАК ЭтоМонтаж,
		               |	БезПодчиненных.ЭтоДемонтаж КАК ЭтоДемонтаж,
		               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
		               |ПОМЕСТИТЬ Уровень1
		               |ИЗ
		               |	БезПодчиненных КАК БезПодчиненных
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Подчиненные
		               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
		               |			И БезПодчиненных.СтруктураИерархии = Подчиненные.СтруктураИерархии
		               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
		               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
		               |	БезПодчиненных.Период КАК Период,
		               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
		               |	БезПодчиненных.ЭтоМонтаж КАК ЭтоМонтаж,
		               |	БезПодчиненных.ЭтоДемонтаж КАК ЭтоДемонтаж,
		               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
		               |ПОМЕСТИТЬ Уровень2
		               |ИЗ
		               |	Уровень1 КАК БезПодчиненных
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Подчиненные
		               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
		               |			И БезПодчиненных.СтруктураИерархии = Подчиненные.СтруктураИерархии
		               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
		               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
		               |	БезПодчиненных.Период КАК Период,
		               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
		               |	БезПодчиненных.ЭтоМонтаж КАК ЭтоМонтаж,
		               |	БезПодчиненных.ЭтоДемонтаж КАК ЭтоДемонтаж,
		               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
		               |ПОМЕСТИТЬ ВсеУровни
		               |ИЗ
		               |	Уровень2 КАК БезПодчиненных
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Подчиненные
		               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
		               |			И БезПодчиненных.СтруктураИерархии = Подчиненные.СтруктураИерархии
		               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	БезПодчиненных.РодительИерархии,
		               |	БезПодчиненных.СтруктураИерархии,
		               |	БезПодчиненных.Период,
		               |	БезПодчиненных.ПредыдущийРодитель,
		               |	БезПодчиненных.ЭтоМонтаж,
		               |	БезПодчиненных.ЭтоДемонтаж,
		               |	БезПодчиненных.ОбъектИерархии
		               |ИЗ
		               |	БезПодчиненных КАК БезПодчиненных
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Уровень1.РодительИерархии,
		               |	Уровень1.СтруктураИерархии,
		               |	Уровень1.Период,
		               |	Уровень1.ПредыдущийРодитель,
		               |	Уровень1.ЭтоМонтаж,
		               |	Уровень1.ЭтоДемонтаж,
		               |	Уровень1.ОбъектИерархии
		               |ИЗ
		               |	Уровень1 КАК Уровень1
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Уровень2.РодительИерархии,
		               |	Уровень2.СтруктураИерархии,
		               |	Уровень2.Период,
		               |	Уровень2.ПредыдущийРодитель,
		               |	Уровень2.ЭтоМонтаж,
		               |	Уровень2.ЭтоДемонтаж,
		               |	Уровень2.ОбъектИерархии
		               |ИЗ
		               |	Уровень2 КАК Уровень2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВсеУровни.ОбъектИерархии КАК ОбъектИерархии,
		               |	МАКСИМУМ(ВсеУровни.ЭтоМонтаж) КАК ЭтоМонтаж,
		               |	ВсеУровни.СтруктураИерархии КАК СтруктураИерархии,
		               |	ВсеУровни.Период КАК Период
		               |ПОМЕСТИТЬ ПриоритетыИтога
		               |ИЗ
		               |	ВсеУровни КАК ВсеУровни
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВсеУровни.ОбъектИерархии,
		               |	ВсеУровни.СтруктураИерархии,
		               |	ВсеУровни.Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВсеУровни.РодительИерархии КАК РодительИерархии,
		               |	ВсеУровни.СтруктураИерархии КАК СтруктураИерархии,
		               |	ВсеУровни.Период КАК Период,
		               |	ВсеУровни.ПредыдущийРодитель КАК ПредыдущийРодитель,
		               |	ВсеУровни.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоМонтаж,
		               |	ВсеУровни.ПредыдущийРодитель.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоДемонтаж,
		               |	ВсеУровни.ОбъектИерархии КАК ОбъектИерархии
		               |ИЗ
		               |	ВсеУровни КАК ВсеУровни
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыИтога КАК ПриоритетыИтога
		               |		ПО ВсеУровни.ОбъектИерархии = ПриоритетыИтога.ОбъектИерархии
		               |			И ВсеУровни.СтруктураИерархии = ПриоритетыИтога.СтруктураИерархии
		               |			И ВсеУровни.Период = ПриоритетыИтога.Период
		               |			И ВсеУровни.ЭтоМонтаж = ПриоритетыИтога.ЭтоМонтаж";
		Запрос.УстановитьПараметр("ТЧ",ВременнаяТаблицаЗначений);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоМонтаж = Истина Тогда 
					НаборЗаписейИсторииПеремещения = РегистрыСведений.торо_ИсторияПеремещенияОборудованияМеждуФМ.СоздатьНаборЗаписей();
					НаборЗаписейИсторииПеремещения.Отбор.ФункциональноеМесто.Установить(Выборка.РодительИерархии);
					НаборЗаписейИсторииПеремещения.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектИерархии);
					НаборЗаписейИсторииПеремещения.Отбор.Период.Установить(Выборка.Период);
					НоваяСтрокаНабораЗаписей = НаборЗаписейИсторииПеремещения.Добавить();
					НоваяСтрокаНабораЗаписей.Период = Выборка.Период;
					НоваяСтрокаНабораЗаписей.ОбъектРемонта = Выборка.ОбъектИерархии;
					НоваяСтрокаНабораЗаписей.ФункциональноеМесто = Выборка.РодительИерархии;
					НоваяСтрокаНабораЗаписей.Событие = Перечисления.торо_СобытияОборудованияНаФМ.Установка;
					НаборЗаписейИсторииПеремещения.Записать();
				КонецЕсли;
				//
				Если Выборка.ЭтоДемонтаж = Истина Тогда 
					НаборЗаписейИсторииПеремещения = РегистрыСведений.торо_ИсторияПеремещенияОборудованияМеждуФМ.СоздатьНаборЗаписей();
					НаборЗаписейИсторииПеремещения.Отбор.ФункциональноеМесто.Установить(Выборка.ПредыдущийРодитель);
					НаборЗаписейИсторииПеремещения.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектИерархии);
					НаборЗаписейИсторииПеремещения.Отбор.Период.Установить(Выборка.Период);
					НоваяСтрокаНабораЗаписей = НаборЗаписейИсторииПеремещения.Добавить();
					НоваяСтрокаНабораЗаписей.Период = Выборка.Период;
					НоваяСтрокаНабораЗаписей.ОбъектРемонта = Выборка.ОбъектИерархии;
					НоваяСтрокаНабораЗаписей.ФункциональноеМесто = Выборка.ПредыдущийРодитель;
					НоваяСтрокаНабораЗаписей.Событие = Перечисления.торо_СобытияОборудованияНаФМ.Демонтаж;
					НаборЗаписейИсторииПеремещения.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ, Замещение)
	ТолькоОР = Новый Массив();
	НужнаяСтруктура = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
		Если СтрокаНабораЗаписей.СтруктураИерархии = НужнаяСтруктура И ТолькоОР.Найти(СтрокаНабораЗаписей.ОбъектИерархии) = Неопределено Тогда 
			ТолькоОР.Добавить(СтрокаНабораЗаписей.ОбъектИерархии);
		КонецЕсли;
	КонецЦикла;
	ОтборСтруктура = Неопределено; ОтборОбъект = Неопределено;
	Для Каждого СтрокаОтбораНабораЗаписей Из ЭтотОбъект.Отбор Цикл
		Если СтрокаОтбораНабораЗаписей.Имя = "СтруктураИерархии" Тогда 
			ОтборСтруктура = СтрокаОтбораНабораЗаписей.Значение;
		ИначеЕсли СтрокаОтбораНабораЗаписей.Имя = "ОбъектИерархии" Тогда 
			ОтборОбъект = СтрокаОтбораНабораЗаписей.Значение;
		КонецЕсли;
	КонецЦикла;
	Если ТолькоОР.Количество() Тогда 
		Для Каждого ОбъектРемонтаИзМассива Из ТолькоОР Цикл
			гкс_ПроверкаФункциональныхМест.ОбновитьТекущийОР(ОбъектРемонтаИзМассива);
		КонецЦикла;
	Иначе
		Если ОтборСтруктура = НужнаяСтруктура И Не ОтборОбъект = Неопределено Тогда 
			гкс_ПроверкаФункциональныхМест.ОбновитьТекущийОР(ОтборОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
